Repository: kenorb/kpf
Catalog: trunk/sites/all/modules/contrib/taxonomy/taxonomy_menu_trails/translations/*.po
Languages: ru

source: Only if node doesn't have enabled menu item
ru: Только если у материала нет включенного пункта меню

source: Node's term selection method
ru: Способ выбора термина материала

source: This option defines how module chooses term for processing:<ul><li><b>First/Last</b> - just select lightest/haviest node's term (but it can be the term without menu item). Best performance.</li><li><b>First/last with menu item</b> - find first/last term with enabled menu item. Low performance</li><li><b>Deepest in lineage</b> - use deepest term in selected lineage. All parent terms in lineage must be attached to node for this function to work. It's highly recommended to use Hierarchical Select for lineage saving. Low performance.</ul>
ru: Эта опция определяет как модуль будет выбирать термин для работы:<ul><li><b>Первый/Последний</b> - будет выбран самый легкий/тяжелый термин материала (но это может оказаться термин без пункта меню). Наилучшая производительность.</li><li><b>Первый/Последний с меню</b> - будет найден первый/последний термин с включенным пунктом меню. Низкая производительность.</li><li><b>Самый глубокий в иерархии</b> - будет использован самый глубокий из иерархии. Чтобы эта функция работала, все термины-предки должны быть связаны с данным материалом. Настоятельно рекомендуется использовать Hierarchical Select для сохранения пути в иерархии. Низкая производительность.</ul>

source: First term
ru: Первый термин

source: Last term
ru: Последний термин

source: Deepest in lineage
ru: Самый глубокий в иерархии

source: Get term's path from Taxonomy Menu modules
ru: Получать путь термина из модулей Taxonomy Menu

source: If you set up not default path for terms' menu items with Taxonomy Menu modules, module will use this paths.
ru: Если вы настроили нестандартные пути для пунктов меню терминов в модулях Taxonomy Menu, будут использоваться эти пути.

source: Vocabularies to select terms from
ru: Словари из которых будут выбираться термины

source: Changes menu trail of current node to its term's menu item. Provides optional integration with Taxonomy Menu modules.
ru: Изменяет текущий путь в меню для текущего материала на путь его термина. Предоставляет опциональную интеграцию с модулями Taxonomy Menu.
